In [2]:
import pandas as pd
df=pd.read_csv("/home/root1234/Desktop/data.csv")
df

         DATE SUBJECT       DAY  Study Hours  Marks
0  20/12/2018     ADB       Mon            8     70
1  21/12/2018      LP      Tues            6     55
2  22/12/2018      BD       Wed           12     87
3  23/12/2018    SAMA  Thursday           16     60
4  24/12/2018      DM    Friday            4     79

In [5]:
import pandas as pd
df=pd.read_csv("/home/root1234/Desktop/data.csv")
df
df.head(2)

         DATE SUBJECT   DAY  Study Hours  Marks
0  20/12/2018     ADB   Mon            8     70
1  21/12/2018      LP  Tues            6     55

In [6]:
df[2:5]

         DATE SUBJECT       DAY  Study Hours  Marks
2  22/12/2018      BD       Wed           12     87
3  23/12/2018    SAMA  Thursday           16     60
4  24/12/2018      DM    Friday            4     79

In [8]:
df[:]

         DATE SUBJECT       DAY  Study Hours  Marks
0  20/12/2018     ADB       Mon            8     70
1  21/12/2018      LP      Tues            6     55
2  22/12/2018      BD       Wed           12     87
3  23/12/2018    SAMA  Thursday           16     60
4  24/12/2018      DM    Friday            4     79

In [9]:
df.columns

Index(['DATE', 'SUBJECT', 'DAY', 'Study Hours', 'Marks'], dtype='object')

In [11]:
df.Marks

0    70
1    55
2    87
3    60
4    79
Name: Marks, dtype: int64

In [13]:
df.DATE

0    20/12/2018
1    21/12/2018
2    22/12/2018
3    23/12/2018
4    24/12/2018
Name: DATE, dtype: object

In [14]:
type(df['Marks'])

pandas.core.series.Series

In [18]:
df[['SUBJECT','Marks']]

  SUBJECT  Marks
0     ADB     70
1      LP     55
2      BD     87
3    SAMA     60
4      DM     79

In [19]:
df['Marks'].min()

55

In [20]:
df['Marks'].max()

87

In [21]:
df['Marks'].std()

13.179529581893277

In [22]:
df.describe()

       Study Hours     Marks
count     5.000000   5.00000
mean      9.200000  70.20000
std       4.816638  13.17953
min       4.000000  55.00000
25%       6.000000  60.00000
50%       8.000000  70.00000
75%      12.000000  79.00000
max      16.000000  87.00000

In [23]:
df['Marks'].sum()

351

In [24]:
df[df.Marks>=70]

         DATE SUBJECT     DAY  Study Hours  Marks
0  20/12/2018     ADB     Mon            8     70
2  22/12/2018      BD     Wed           12     87
4  24/12/2018      DM  Friday            4     79

In [25]:
df[df.Marks==df.Marks.max()]

         DATE SUBJECT  DAY  Study Hours  Marks
2  22/12/2018      BD  Wed           12     87

In [26]:
df[df.Marks==df.Marks.min()]

         DATE SUBJECT   DAY  Study Hours  Marks
1  21/12/2018      LP  Tues            6     55

In [28]:
df['Study Hours'][df.Marks==df['Marks'].max()]

2    12
Name: Study Hours, dtype: int64

In [32]:
df[['Study Hours','DAY']][df.Marks==df['Marks'].max()]

   Study Hours  DAY
2           12  Wed